Samplecode-MM32/MM32W0xxxxB_samplecode/MM32W0xxxxB_q_samplecode/MM32W0xx_BLE_INT_SV3.5.9_Q_EN/Device/MM32W0xx_q/Include/MM32W0xx_q.h
/********************  Bit definition for ADDATA register  ********************/
#define  ADDATA_DATA                        ((uint32_t)0x0000FFFF)               /*!<ADC 12bit convert data */

#define  ADDATA_CHANNELSEL                  ((uint32_t)0x000F0000)               /*!<CHANNELSEL[19:16] (ADC current channel convert data) */
#define  ADDATA_CHANNELSEL_CH0              ((uint32_t)0x00000000)               /*!<CHANNELSEL CH0*/
#define  ADDATA_CHANNELSEL_CH1              ((uint32_t)0x00010000)               /*!<CHANNELSEL CH1*/
#define  ADDATA_CHANNELSEL_CH2              ((uint32_t)0x00020000)               /*!<CHANNELSEL CH2*/
#define  ADDATA_CHANNELSEL_CH3              ((uint32_t)0x00030000)               /*!<CHANNELSEL CH3*/
#define  ADDATA_CHANNELSEL_CH4              ((uint32_t)0x00040000)               /*!<CHANNELSEL CH4*/
#define  ADDATA_CHANNELSEL_CH5              ((uint32_t)0x00050000)               /*!<CHANNELSEL CH5*/
#define  ADDATA_CHANNELSEL_CH6              ((uint32_t)0x00060000)               /*!<CHANNELSEL CH6*/
#define  ADDATA_CHANNELSEL_CH7              ((uint32_t)0x00070000)               /*!<CHANNELSEL CH7*/
#define  ADDATA_CHANNELSEL_CH8              ((uint32_t)0x00080000)               /*!<CHANNELSEL CH8*/
#define  ADDATA_CHANNELSEL_CH9              ((uint32_t)0x00090000)               /*!<CHANNELSEL CH9*/
#define ADDATA_CHANNELSEL_CH10              ((uint32_t)0x000A0000)               /*!<CHANNELSEL CH10*/
#define ADDATA_CHANNELSEL_CH11              ((uint32_t)0x000B0000)               /*!<CHANNELSEL CH11*/
#define  ADDATA_CHANNELSEL_CH12             ((uint32_t)0x000C0000)               /*!<CHANNELSEL CH12*/
#define  ADDATA_CHANNELSEL_CH13             ((uint32_t)0x000D0000)               /*!<CHANNELSEL CH13*/
#define  ADDATA_CHANNELSEL_CH14             ((uint32_t)0x000E0000)               /*!<CHANNELSEL CH14*/
#define  ADDATA_CHANNELSEL_CH15             ((uint32_t)0x000F0000)               /*!<CHANNELSEL CH15*/

#define ADDATA_CHANNELSEL_TempSenSor        ADDATA_CHANNELSEL_CH14               /*!<CHANNELSEL CH14*/
#define ADDATA_CHANNELSEL_VolSensor         ADDATA_CHANNELSEL_CH15               /*!<CHANNELSEL CH15*/

#define  ADDATA_OVERRUN                     ((uint32_t)0x00100000)               /*!<ADC data will be cover */
#define  ADDATA_VALID                       ((uint32_t)0x00200000)               /*!<ADC data[11:0] is valid*/

/********************  Bit definition for ADCFG register  ********************/
#define  ADCFG_ADEN                        ((uint32_t)0x00000001)               /*!<ADC convert enable */
#define  ADCFG_ADWEN                       ((uint32_t)0x00000002)               /*!<ADC window compare enable */
#define  ADCFG_TSEN                        ((uint32_t)0x00000004)               /*!<ADC sensor enable */
#define  ADCFG_VSEN                        ((uint32_t)0x00000008)               /*!<ADC sensor enable */

#define  ADCFG_ADCPRE                      ((uint32_t)0x00004070)               /*!<ADC preclk  */
#define  ADCFG_ADCPRE_2                    ((uint32_t)0x00000000)               /*!<ADC preclk 2 */
#define  ADCFG_ADCPRE_4                    ((uint32_t)0x00000010)               /*!<ADC preclk 4 */
#define  ADCFG_ADCPRE_6                    ((uint32_t)0x00000020)               /*!<ADC preclk 6 */
#define  ADCFG_ADCPRE_8                    ((uint32_t)0x00000030)               /*!<ADC preclk 8 */
#define  ADCFG_ADCPRE_10                   ((uint32_t)0x00000040)               /*!<ADC preclk 10 */
#define  ADCFG_ADCPRE_12                   ((uint32_t)0x00000050)               /*!<ADC preclk 12 */
#define  ADCFG_ADCPRE_14                   ((uint32_t)0x00000060)               /*!<ADC preclk 14 */
#define  ADCFG_ADCPRE_16                   ((uint32_t)0x00000070)               /*!<ADC preclk 16 */
#define  ADCFG_ADCPRE_3                    ((uint32_t)0x00004000)               /*!<ADC preclk 3 */
#define  ADCFG_ADCPRE_5                    ((uint32_t)0x00004010)               /*!<ADC preclk 5 */
#define  ADCFG_ADCPRE_7                    ((uint32_t)0x00004020)               /*!<ADC preclk 7 */
#define  ADCFG_ADCPRE_9                    ((uint32_t)0x00004030)               /*!<ADC preclk 9 */
#define  ADCFG_ADCPRE_11                   ((uint32_t)0x00004040)               /*!<ADC preclk 11 */
#define  ADCFG_ADCPRE_13                   ((uint32_t)0x00004050)               /*!<ADC preclk 13 */
#define  ADCFG_ADCPRE_15                   ((uint32_t)0x00004060)               /*!<ADC preclk 15 */
#define  ADCFG_ADCPRE_17                   ((uint32_t)0x00004070)               /*!<ADC preclk 17 */


#define  ADCFG_RSLTCTL                        ((uint32_t)0x00000380)               /*!<ADC resolution select*/

#define  ADCFG_RSLTCTL_0                      ((uint32_t)0x00000080)
#define  ADCFG_RSLTCTL_1                      ((uint32_t)0x00000100)
#define  ADCFG_RSLTCTL_2                      ((uint32_t)0x00000200)

#define  ADCFG_RSLTCTL_12                     ((uint32_t)0x00000000)              /*!<ADC resolution select 12bit*/
#define  ADCFG_RSLTCTL_11                     ((uint32_t)0x00000080)              /*!<ADC resolution select 11bit*/
#define  ADCFG_RSLTCTL_10                     ((uint32_t)0x00000100)              /*!<ADC resolution select 10bit*/
#define  ADCFG_RSLTCTL_9                      ((uint32_t)0x00000180)              /*!<ADC resolution select 9bit*/
#define  ADCFG_RSLTCTL_8                      ((uint32_t)0x00000200)              /*!<ADC resolution select 8bit*/


#define  ADCFG_SAMCTL                         ((uint32_t)0x00003C00)               /*!<ADC sample time select*/

#define  ADCFG_SAMCTL_0                       ((uint32_t)0x00000400)
#define  ADCFG_SAMCTL_1                       ((uint32_t)0x00000800)
#define  ADCFG_SAMCTL_2                       ((uint32_t)0x00001000)
#define  ADCFG_SAMCTL_3                       ((uint32_t)0x00002000)
#define  ADCFG_SAMCTL_OFFSET                  10
#define  ADCFG_SAMCTL_1_5                     ((uint32_t)0x0<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 1.5t*/
#define  ADCFG_SAMCTL_7_5                     ((uint32_t)0x1<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 7.5t*/
#define  ADCFG_SAMCTL_13_5                    ((uint32_t)0x2<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 13.5t*/
#define  ADCFG_SAMCTL_28_5                    ((uint32_t)0x3<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 28.5t*/
#define  ADCFG_SAMCTL_41_5                    ((uint32_t)0x4<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 41.5t*/
#define  ADCFG_SAMCTL_55_5                    ((uint32_t)0x5<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 55.5t*/
#define  ADCFG_SAMCTL_71_5                    ((uint32_t)0x6<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 71.5t*/
#define  ADCFG_SAMCTL_239_5                   ((uint32_t)0x7<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 239.5t*/
#define  ADCFG_SAMCTL_2_5                     ((uint32_t)0x8<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 2.5t*/
#define  ADCFG_SAMCTL_3_5                     ((uint32_t)0x9<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 3.5t*/
#define  ADCFG_SAMCTL_4_5                     ((uint32_t)0xA<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 4.5t*/
#define  ADCFG_SAMCTL_5_5                     ((uint32_t)0xB<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 5.5t*/
#define  ADCFG_SAMCTL_6_5                     ((uint32_t)0xC<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 6.5t*/

/********************  Bit definition for ADCR register  ********************/
#define  ADCR_ADIE                            ((uint32_t)0x00000001)               /*!<ADC interrupt enable */
#define  ADCR_ADWIE                           ((uint32_t)0x00000002)               /*!<ADC window compare interrupt enable */
#define  ADCR_TRGEN                           ((uint32_t)0x00000004)               /*!<extranal trigger single start AD convert */
#define  ADCR_DMAEN                           ((uint32_t)0x00000008)               /*!<ADC DMA enable */

#define  ADCR_TRGSEL                          ((uint32_t)0x00000070)               /*!<TRGSEL[6:4]  ADC external trigger source select */
#define  ADCR_TRGSEL_0                        ((uint32_t)0x00000010)               /*!<Bit 0 */
#define  ADCR_TRGSEL_1                        ((uint32_t)0x00000020)               /*!<Bit 1 */
#define  ADCR_TRGSEL_2                        ((uint32_t)0x00000040)               /*!<Bit 2 */


#define  ADCR_TRGSEL_TIM1_CC1                 ((uint32_t)0x00000000)               /*!<TIM1_CC1 as trig source*/
#define  ADCR_TRGSEL_TIM1_CC2                 ((uint32_t)0x00000010)               /*!<TIM1_CC2 as trig source*/
#define  ADCR_TRGSEL_TIM1_CC3                 ((uint32_t)0x00000020)               /*!<TIM1_CC3 as trig source*/
#define  ADCR_TRGSEL_TIM2_CC2                 ((uint32_t)0x00000030)               /*!<TIM2_CC2 as trig source*/
#define  ADCR_TRGSEL_TIM3_CC1                 ((uint32_t)0x00000060)               /*!<TIM3_CC1 as trig source*/
#define  ADCR_TRGSEL_EXTI_11                  ((uint32_t)0x00000070)               /*!<EXTI_11 as trig source*/

