Samplecode-MM32/MM32W0xxxxB_samplecode/MM32W0xxxxB_q_samplecode/MM32W0xx_BLE_INT_SV3.5.9_Q_EN/Device/MM32W0xx_q/Include/MM32W0xx_q.h
#define  TIM_CCMR3_OC5CE                     ((uint16_t)0x0080)            /*!<Output Compare 5 Clear Enable */


/******************************************************************************/
/*                                                                            */
/*                           Independent WATCHDOG                             */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for IWDG_KR register  ********************/
#define  IWDG_KR_KEY                         ((uint16_t)0xFFFF)            /*!<Key value (write only, read 0000h) */

/*******************  Bit definition for IWDG_PR register  ********************/
#define  IWDG_PR_PR                          ((uint8_t)0x07)               /*!<PR[2:0] (Prescaler divider) */
#define  IWDG_PR_PR_0                        ((uint8_t)0x01)               /*!<Bit 0 */
#define  IWDG_PR_PR_1                        ((uint8_t)0x02)               /*!<Bit 1 */
#define  IWDG_PR_PR_2                        ((uint8_t)0x04)               /*!<Bit 2 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define  IWDG_RLR_RL                         ((uint16_t)0x0FFF)            /*!<Watchdog counter reload value */

/*******************  Bit definition for IWDG_SR register  ********************/
#define  IWDG_SR_PVU                         ((uint8_t)0x01)               /*!<Watchdog prescaler value update */
#define  IWDG_SR_RVU                         ((uint8_t)0x02)               /*!<Watchdog counter reload value update */

/******************************************************************************/
/*                                                                            */
/*                            Window WATCHDOG                                 */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for WWDG_CR register  ********************/
#define  WWDG_CR_T                           ((uint8_t)0x7F)               /*!<T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define  WWDG_CR_T0                          ((uint8_t)0x01)               /*!<Bit 0 */
#define  WWDG_CR_T1                          ((uint8_t)0x02)               /*!<Bit 1 */
#define  WWDG_CR_T2                          ((uint8_t)0x04)               /*!<Bit 2 */
#define  WWDG_CR_T3                          ((uint8_t)0x08)               /*!<Bit 3 */
#define  WWDG_CR_T4                          ((uint8_t)0x10)               /*!<Bit 4 */
#define  WWDG_CR_T5                          ((uint8_t)0x20)               /*!<Bit 5 */
#define  WWDG_CR_T6                          ((uint8_t)0x40)               /*!<Bit 6 */

#define  WWDG_CR_WDGA                        ((uint8_t)0x80)               /*!<Activation bit */

/*******************  Bit definition for WWDG_CFR register  *******************/
#define  WWDG_CFR_W                          ((uint16_t)0x007F)            /*!<W[6:0] bits (7-bit window value) */
#define  WWDG_CFR_W0                         ((uint16_t)0x0001)            /*!<Bit 0 */
#define  WWDG_CFR_W1                         ((uint16_t)0x0002)            /*!<Bit 1 */
#define  WWDG_CFR_W2                         ((uint16_t)0x0004)            /*!<Bit 2 */
#define  WWDG_CFR_W3                         ((uint16_t)0x0008)            /*!<Bit 3 */
#define  WWDG_CFR_W4                         ((uint16_t)0x0010)            /*!<Bit 4 */
#define  WWDG_CFR_W5                         ((uint16_t)0x0020)            /*!<Bit 5 */
#define  WWDG_CFR_W6                         ((uint16_t)0x0040)            /*!<Bit 6 */

#define  WWDG_CFR_WDGTB                      ((uint16_t)0x0180)            /*!<WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFR_WDGTB0                     ((uint16_t)0x0080)            /*!<Bit 0 */
#define  WWDG_CFR_WDGTB1                     ((uint16_t)0x0100)            /*!<Bit 1 */

#define  WWDG_CFR_EWI                        ((uint16_t)0x0200)            /*!<Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_SR register  ********************/
#define  WWDG_SR_EWIF                        ((uint8_t)0x01)               /*!<Early Wakeup Interrupt Flag */

/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface                         */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for SPI_TXREG register  ********************/
#define SPI_TXREG_TXREG ((uint32_t)0xFFFFFFFF) /*!< Transmit data register */

/*******************  Bit definition for SPI_RXREG register  ********************/
#define SPI_RXREG_RXREG ((uint32_t)0xFFFFFFFF) /*!< Receive data register */

/*******************  Bit definition for SPI_CSTAT register  ********************/
#define SPI_CSTAT_TXEPT ((uint8_t)0x01)       /*!< Transmitter empty bit */
#define SPI_CSTAT_RXAVL ((uint8_t)0x02)       /*!< Receive available byte data message */
#define SPI_CSTAT_TXFULL ((uint8_t)0x04)      /*!< Transmitter FIFO full status bit */
#define SPI_CSTAT_RXAVL_4BYTE ((uint8_t)0x08) /*!< Receive available 4 byte data message */

/*******************  Bit definition for SPI_INTSTAT register  ********************/
#define SPI_INTSTAT_TX_INTF ((uint16_t)0x0001)       /*!<  Transmit FIFO available interrupt flag bit*/
#define SPI_INTSTAT_RX_INTF ((uint16_t)0x0002)       /*!<  Receive data available interrupt flag bit*/
#define SPI_INTSTAT_UNDERRUN_INTF ((uint16_t)0x0004) /*!<  SPI underrun interrupt flag bit*/
#define SPI_INTSTAT_RXOERR_INTF ((uint16_t)0x0008)   /*!<  Receive overrun error interrupt flag bit*/
#define SPI_INTSTAT_RXMATCH_INTF ((uint16_t)0x0010)  /*!<  Receive data match the RXDNR number, the receive process will be completed and generate the interrupt*/
#define SPI_INTSTAT_RXFULL_INTF ((uint16_t)0x0020)   /*!<  RX FIFO full interrupt flag bit*/
#define SPI_INTSTAT_TXEPT_INTF ((uint16_t)0x0040)    /*!<  Transmitter empty interrupt flag bit*/

